src/Catalogs/СтекиОшибокЦентрМониторинга/СтекиОшибокЦентрМониторинга.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтекиОшибокЦентрМониторинга</name>
  <attributes>
    <name>ПолныйСтек</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ХешСтека</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/InformationRegisters/ОбъектыБлокировок/ОбъектыБлокировок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОбъектыБлокировок</name>
  <resources>
    <name>Блокировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.КонтрольныеПроцедуры</types>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/СтекиОшибокЦентрМониторинга/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Функция СоздатьЭлементПоХешу(Хеш, ПолныйСтек) Экспорт
		
	//Проверка на недопустимые символы
	ПроверитьНаличиеНедопустимыхСимволов(Хеш, "Хеш");
	ПроверитьНаличиеНедопустимыхСимволов(ПолныйСтек, "ПолныйСтек");
		
	Результат = РезультатЗапросаПоХешу(Хеш);
	Если Результат.Пустой() Тогда
		Попытка
			БлокировкаДанных = Новый БлокировкаДанных;
			ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.ОбъектыБлокировок");
			ЭлементБлокировки.УстановитьЗначение("Объект", "Справочник.СтекиОшибокЦентрМониторинга." + Хеш);
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			БлокировкаДанных.Заблокировать();
		Исключение
			ВызватьИсключение "Центр мониторинга. Ожидаемая управляемая блокировка при создании элемента справочника 'СтекиОшибокЦентрМониторинга'";
		КонецПопытки;
		
		Результат = РезультатЗапросаПоХешу(Хеш);
		Если Результат.Пустой() Тогда
			НовыйЭлемент = Справочники.СтекиОшибокЦентрМониторинга.СоздатьЭлемент();
			НовыйЭлемент.Наименование = Лев(ПолныйСтек, 150);
			НовыйЭлемент.ПолныйСтек = ПолныйСтек;
			НовыйЭлемент.ХешСтека = Хеш;
			НовыйЭлемент.Записать();
			
			РезультатВыполнения = НовыйЭлемент.Ссылка;
		Иначе
			Выборка = Результат.Выбрать();
			Выборка.Следующий();
			РезультатВыполнения = Выборка.Ссылка;
		КонецЕсли;
	Иначе
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		РезультатВыполнения = Выборка.Ссылка;
	КонецЕсли;
	
	Возврат РезультатВыполнения;
КонецФункции

Функция РезультатЗапросаПоХешу(ИмяХеш)
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Ссылка
	|ИЗ
	|	Справочник.СтекиОшибокЦентрМониторинга
	|ГДЕ
	|	ХешСтека = &ХешСтека
	|";
	Запрос.УстановитьПараметр("ХешСтека", ИмяХеш);
	Результат = Запрос.Выполнить();
	
	Возврат Результат;
КонецФункции

Процедура ПроверитьНаличиеНедопустимыхСимволов(Значение, Имя)
	ПозицияНедопустимогоСимвола = НайтиНедопустимыеСимволыXML(Имя);
	Если ПозицияНедопустимогоСимвола > 0 Тогда
		ВызватьИсключение СтрШаблон("Обнаружен недопустимый символ XML, позиция: %1, реквизит: %2", ПозицияНедопустимогоСимвола, Имя);
	КонецЕсли;
КонецПроцедуры

#КонецЕсли
